#include "I2C.h"

/***************************************************************
函数名：I2CStart
功  能：I2C启动信号
参  数：无
返回值：无
***************************************************************/
void I2CStart()
{
	I2C_SCL = 1;//总线空闲时 SCL SDA 都为高电平	
	I2C_SDA = 1;
	I2CDelay();//SCL保持4.7us之后，拉低SDA，产生起始信号
	I2C_SDA = 0;
	I2CDelay();
	I2C_SCL = 0;
}

/***************************************************************
函数名：I2CWriteByte
功  能：写一数据字节到总线上，并接收应答位
参  数：待写入数据
返回值：读取的应答位	0：应答，1：非应答
***************************************************************/
bit I2CWriteByte(unsigned char dat)
{
	unsigned char temp;
	bit ack;
	for (temp = 0x80; temp != 0; temp >>= 1)
	{
		if( (temp & dat) == 0) //当前位为0
			I2C_SDA = 0;
		else									 //当前位为1
			I2C_SDA = 1;
		I2CDelay();//延时至少4us 使SCL保持低
		I2C_SCL = 1;//拉高 器件读数据位
		I2CDelay();//延时至少4us 使SCL保持高
		I2C_SCL = 0;//拉低
	}
	ack = I2CRecvAck();
	return ack;
}

/***************************************************************
函数名：I2CRecvAck
功  能：主机读取从机应答ack
参  数：无
返回值：读取的应答位	0：应答，1：非应答
***************************************************************/
bit I2CRecvAck()
{
	bit ack;
	I2C_SDA = 1;//主机主动释放SDA，为读ack做准备
	I2CDelay();//SCL保持4.7us低
	I2C_SCL = 1;//拉高
	ack = I2C_SDA;
	I2CDelay();//延时至少4us 使SCL保持高
	I2C_SCL = 0;//拉低SCL
	return ack;
}

/***************************************************************
函数名：I2CReadByte
功  能：I2C读取总线上字节数据
参  数：无
返回值：读取的数据
***************************************************************/
unsigned char I2CReadByte()
{
	unsigned char dat = 0;
	unsigned char temp;
	I2C_SDA = 1;//主机释放总线，为接下来的读数据作准备
	for (temp = 0x80; temp != 0; temp >>= 1)//还是从高位到低位读
	{
		I2CDelay();//延时至少4us 使SCL保持低
		I2C_SCL = 1;//拉高 器件读数据位
		if (I2C_SDA == 1)
			dat |= temp;
		else
			dat &= ~temp;
		I2CDelay();//延时至少4us 使SCL保持高
		I2C_SCL = 0;//拉低 为下一次传输作准备
	}
	return dat;
}

/***************************************************************
函数名：SendAck
功  能：主机发送应答/非应答
参  数：ack  0：应答，1：非应答
返回值：无
***************************************************************/
void SendAck(bit ack)
{
	I2C_SDA = ack;
	I2CDelay();//延时至少4us 使SCL保持低
	I2C_SCL = 1;//拉高 器件读数据位
	I2CDelay();//延时至少4us 使SCL保持高
	I2C_SCL = 0;//拉低 为下一次传输作准备
}

/***************************************************************
函数名：I2CStop
功  能：I2C停止信号
参  数：无
返回值：无
***************************************************************/
void I2CStop()
{
	I2C_SCL = 0;
	I2C_SDA = 0;
	I2CDelay();
	I2C_SCL = 1;
	I2CDelay();
	I2C_SDA = 1;
	I2CDelay();
}
