#include "delay.h"

/****************************************
函数名：DelayXms
功  能；毫秒级延时函数
参  数；unsigned int
返回值；无
****************************************/
void DelayXms(unsigned int xms)
{
  unsigned int i, j;  //0 ~ 65535  000H ~ FFFH
  for (i = xms; i > 0; i--)
    for (j = 124; j > 0; j--);
}

/****************************************
函数名：Delay600us
功  能；600毫秒延时函数
参  数；无
返回值；无
****************************************/
void Delay600us()		//@12.000MHz
{
	unsigned char i, j;

	i = 2;
	j = 39;
	do
	{
		while (--j);
	} while (--i);
}

/****************************************
函数名：Delay60us
功  能；60毫秒延时函数
参  数；无
返回值；无
****************************************/
void Delay60us()		//@12.000MHz
{
	unsigned char i;

	_nop_();
	i = 27;
	while (--i);
}
