/****************************************
功  能：带有参数的延时函数实现小灯的闪烁
编程人：FYL
时  间；2021_03_19
版  本：V1.0
****************************************/

//头文件声明
#include <reg51.h>
#include <intrins.h>

//I/O的声明
sbit LED = P1 ^ 7;

//函数的声明
void DelayXms(unsigned int xms);

/****************************************
函数名：main
功  能；主函数
参  数；无
返回值；无
****************************************/
void main()
{
  while(1)
  {
    LED = 0;
    DelayXms(1000);//延时 亮一会
    LED = 1;
    DelayXms(1000);//延时 灭一会
  }
}

/****************************************
函数名：DelayXms
功  能；延时函数
参  数；unsigned int
返回值；无
****************************************/
void DelayXms(unsigned int xms)
{
  unsigned int i, j;  //0 ~ 65535  0000H ~ FFFH
  for (i = xms; i > 0; i--)
  {
    for (j = 124; j > 0; j--)
    {
      
    }  
  }
}