/******************************
功能：C语言移位运算符的方法实现流水灯
编程人：FYL
时间：2021_05_01
版本：V1.2
******************************/

//头文件
#include <reg51.h>
#include "delay.h"

/******************************
函数名：main
功  能：主函数
参  数：无
返回值：无
******************************/
void main()
{
  unsigned char temp = 0x1;// 0000 0001
  unsigned char i;
  while (1)
  {
    for (i = 0; i < 8; i++)
    {
      P1 = ~(temp << i);
      DelayXms(1000);
    }        
  }
}

/*
  while (1)
  {
    P1 = ~(temp << i++);
    if (8 == i) i = 0;
    DelayXms(1000);        
  }
}
*/